ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_fmc.h
/* FMC_STAT */
#define FMC_STAT_BUSY                     BIT(0)                           /*!< flash busy flag bit */
#define FMC_STAT_ENDF                     BIT(16)                          /*!< end of operation flag bit */
#define FMC_STAT_WPERR                    BIT(17)                          /*!< erase/program protection error flag bit */
#define FMC_STAT_PGSERR                   BIT(18)                          /*!< program sequence error flag bit */
#define FMC_STAT_RPERR                    BIT(23)                          /*!< read protection error flag bit */
#define FMC_STAT_RSERR                    BIT(24)                          /*!< read secure error flag bit */
#define FMC_STAT_ECCCOR                   BIT(25)                          /*!< one bit correct error flag bit */
#define FMC_STAT_ECCDET                   BIT(26)                          /*!< two bits detect error flag bit */
#define FMC_STAT_OBMERR                   BIT(30)                          /*!< option byte modify error flag */
#define FMC_STAT_FECCF                    BIT(31)                          /*!< flash ECC function flag */

/* FMC_ADDR */
#define FMC_ADDR_ADDR                     BITS(0,31)                       /*!< address of flash to be erased */

/* FMC_OBCTL */
#define FMC_OBCTL_OBLK                    BIT(0)                           /*!< FMC_OBCTL lock bit */
#define FMC_OBCTL_OBSTART                 BIT(1)                           /*!< send option bytes modification start command to FMC */
#define FMC_OBCTL_OBMERRIE                BIT(30)                          /*!< option byte modify error interrupt enable bit */

/* FMC_OBSTAT0_EFT */
#define FMC_OBSTAT0_EFT_BOR_TH            BITS(2,3)                        /*!< effective option byte brownout reset threshold value */
#define FMC_OBSTAT0_EFT_NWDG_HW           BIT(4)                           /*!< effective option byte watchdog value */
#define FMC_OBSTAT0_EFT_NRST_DPSLP        BIT(6)                           /*!< effective option byte deepsleep reset value */
#define FMC_OBSTAT0_EFT_NRST_STDBY        BIT(7)                           /*!< effective option byte standby reset value */
#define FMC_OBSTAT0_EFT_SPC               BITS(8,15)                       /*!< effective option byte security protection code */
#define FMC_OBSTAT0_EFT_FWDGSPD_DPSLP     BIT(17)                          /*!< effective option byte watchdog suspend status in deepsleep mode */
#define FMC_OBSTAT0_EFT_FWDGSPD_STDBY     BIT(18)                          /*!< effective option byte watchdog suspend status in standby mode */
#define FMC_OBSTAT0_EFT_SCR               BIT(21)                          /*!< effective option byte security access mode status bit */
#define FMC_OBSTAT0_EFT_ITCMECCEN         BIT(22)                          /*!< effective option byte ITCM ECC function enable status bit */
#define FMC_OBSTAT0_EFT_DTCM0ECCEN        BIT(23)                          /*!< effective option byte DTCM0 ECC function enable status bit */
#define FMC_OBSTAT0_EFT_DTCM1ECCEN        BIT(24)                          /*!< effective option byte DTCM1 ECC function enable status bit */
#define FMC_OBSTAT0_EFT_IOSPDOPEN         BIT(29)                          /*!< effective option byte I/O speed optimization, high-speed at low-voltage enable status bit */

/* FMC_OBSTAT0_MDF */
#define FMC_OBSTAT0_MDF_BOR_TH            BITS(2,3)                        /*!< modified option byte brownout reset threshold value */
#define FMC_OBSTAT0_MDF_NWDG_HW           BIT(4)                           /*!< modified option byte watchdog value */
#define FMC_OBSTAT0_MDF_NRST_DPSLP        BIT(6)                           /*!< modified option byte deepsleep reset value */
#define FMC_OBSTAT0_MDF_NRST_STDBY        BIT(7)                           /*!< modified option byte standby reset value */
#define FMC_OBSTAT0_MDF_SPC               BITS(8,15)                       /*!< modified option byte security protection code */
#define FMC_OBSTAT0_MDF_FWDGSPD_DPSLP     BIT(17)                          /*!< modified option byte watchdog suspend status in deepsleep mode */
#define FMC_OBSTAT0_MDF_FWDGSPD_STDBY     BIT(18)                          /*!< modified option byte watchdog suspend status in standby mode */
#define FMC_OBSTAT0_MDF_SCR               BIT(21)                          /*!< modified option byte security access mode status bit */
#define FMC_OBSTAT0_MDF_ITCMECCEN         BIT(22)                          /*!< modified option byte ITCM ECC function enable status bit */
#define FMC_OBSTAT0_MDF_DTCM0ECCEN        BIT(23)                          /*!< modified option byte DTCM0 ECC function enable status bit */
#define FMC_OBSTAT0_MDF_DTCM1ECCEN        BIT(24)                          /*!< modified option byte DTCM1 ECC function enable status bit */
#define FMC_OBSTAT0_MDF_IOSPDOPEN         BIT(29)                          /*!< modified option byte I/O speed optimization, high-speed at low-voltage enable status bit */

/* FMC_DCRPADDR_EFT */
#define FMC_DCRPADDR_EFT_DCRP_AREA_START  BITS(0,10)                       /*!< effective option byte DCRP area start status bits */
#define FMC_DCRPADDR_EFT_DCRP_AREA_END    BITS(16,26)                      /*!< effective option byte DCRP area end status bits */
#define FMC_DCRPADDR_EFT_DCRP_EREN        BIT(31)                          /*!< effective option byte DCRP area erase enable bit */

/* FMC_DCRPADDR_MDF */
#define FMC_DCRPADDR_MDF_DCRP_AREA_START  BITS(0,10)                       /*!< modified option byte DCRP area start status bits */
#define FMC_DCRPADDR_MDF_DCRP_AREA_END    BITS(16,26)                      /*!< modified option byte DCRP area end status bits */
#define FMC_DCRPADDR_MDF_DCRP_EREN        BIT(31)                          /*!< modified option byte DCRP area erase enable bit */

/* FMC_SCRADDR_EFT */
#define FMC_SCRADDR_EFT_SCR_AREA_START    BITS(0,10)                       /*!< effective option byte secure-access area start status bits */
#define FMC_SCRADDR_EFT_SCR_AREA_END      BITS(16,26)                      /*!< effective option byte secure-access area end status bits */
#define FMC_SCRADDR_EFT_SCR_EREN          BIT(31)                          /*!< effective option byte secure-access area erase enable bit */

