ssenja/TMM737/BSP/GD32H7xx_HAL/INC/gd32h73x_75x_fmc.h
/* FMC_SCRADDR_MDF */
#define FMC_SCRADDR_MDF_SCR_AREA_START    BITS(0,10)                       /*!< modified option byte secure-access area start status bits */
#define FMC_SCRADDR_MDF_SCR_AREA_END      BITS(16,26)                      /*!< modified option byte secure-access area end status bits */
#define FMC_SCRADDR_MDF_SCR_EREN          BIT(31)                          /*!< modified option byte secure-access area erase enable bit */

/* FMC_WP_EFT */
#define FMC_WP_EFT_WP                     BITS(0,29)                       /*!< effective option byte erase/program protection status bits */

/* FMC_WP_MDF */
#define FMC_WP_MDF_WP                     BITS(0,29)                       /*!< modified option byte erase/program protection status bits */

/* FMC_BTADDR_EFT */
#define FMC_BTADDR_EFT_BOOT_ADDR0         BITS(0,15)                       /*!< effective option byte boot address 0 */
#define FMC_BTADDR_EFT_BOOT_ADDR1         BITS(16,31)                      /*!< effective option byte boot address 1 */

/* FMC_BTADDR_MDF */
#define FMC_BTADDR_MDF_BOOT_ADDR0         BITS(0,15)                       /*!< modified option byte boot address 0 */
#define FMC_BTADDR_MDF_BOOT_ADDR1         BITS(16,31)                      /*!< modified option byte boot address 1 */

/* FMC_OBSTAT1_EFT */
#define FMC_OBSTAT1_EFT_ITCM_SZ_SHRRAM    BITS(0,3)                        /*!< effective option byte ITCM size of shared RAM */
#define FMC_OBSTAT1_EFT_DTCM_SZ_SHRRAM    BITS(4,7)                        /*!< effective option byte DTCM size of shared RAM */
#define FMC_OBSTAT1_EFT_DATA              BITS(16,31)                      /*!< effective option byte user data value */

/* FMC_OBSTAT1_MDF */
#define FMC_OBSTAT1_MDF_ITCM_SZ_SHRRAM    BITS(0,3)                        /*!< modified option byte ITCM size of shared RAM */
#define FMC_OBSTAT1_MDF_DTCM_SZ_SHRRAM    BITS(4,7)                        /*!< modified option byte DTCM size of shared RAM */
#define FMC_OBSTAT1_MDF_DATA              BITS(16,31)                      /*!< modified option byte user data value */

/* FMC_NODEC */
#define FMC_NODEC_NODEC_AREA_START        BITS(0,10)                       /*!< NO-RTDEC area start status bits */
#define FMC_NODEC_NODEC_AREA_END          BITS(16,26)                      /*!< NO-RTDEC area end status bits */

/* FMC_ECCADDR */
#define FMC_ECCADDR_ECCADDR               BITS(0,31)                       /*!< address of byte where an ECC error is detected */

/* FMC_AESIV0_EFT */
#define FMC_AESIV0_EFT_AESIV              BITS(0,31)                       /*!< AES initialization vector status value 0 */

/* FMC_AESIV1_EFT */
#define FMC_AESIV1_EFT_AESIV              BITS(0,31)                       /*!< AES initialization vector status value 1 */

/* FMC_AESIV2_EFT */
#define FMC_AESIV2_EFT_AESIV              BITS(0,31)                       /*!< AES initialization vector status value 2 */

/* FMC_AESIV0_MDF */
#define FMC_AESIV0_MDF_AESIV              BITS(0,31)                       /*!< AES initialization vector configuration value 0 */

/* FMC_AESIV1_MDF */
#define FMC_AESIV1_MDF_AESIV              BITS(0,31)                       /*!< AES initialization vector configuration value 1 */

/* FMC_AESIV2_MDF */
#define FMC_AESIV2_MDF_AESIV              BITS(0,31)                       /*!< AES initialization vector configuration value 2 */

/* FMC_PID0 */
#define FMC_PID0_PID                      BITS(0,31)                       /*!< product ID 0 */

/* FMC_PID1 */
#define FMC_PID1_PID                      BITS(0,31)                       /*!< product ID 1 */

/* constants definitions */
/* FMC state */
typedef enum {
    FMC_READY = 0U,                                                        /*!< the operation has been completed */
    FMC_BUSY,                                                              /*!< the operation is in progress */
    FMC_WPERR,                                                             /*!< erase/program protection error */
    FMC_PGSERR,                                                            /*!< program sequence error */
    FMC_RPERR,                                                             /*!< read protection error */
    FMC_RSERR,                                                             /*!< read secure error */
    FMC_ECCCOR,                                                            /*!< one bit correct error */
    FMC_ECCDET,                                                            /*!< two bits detect error */
    FMC_OBMERR,                                                            /*!< option byte modify error */
    FMC_TOERR                                                              /*!< timeout error */
} fmc_state_enum;

/* define the FMC bit position and its register index offset */
#define FMC_REGIDX_BIT(regidx, bitpos)  (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos))
#define FMC_REG_VAL(offset)             (REG32(FMC + (((uint32_t)(offset) & 0x0000FFFFU) >> 6)))
#define FMC_BIT_POS(val)                ((uint32_t)(val) & 0x0000001FU)
#define FMC_REGIDX_BIT2(regidx, bitpos, regidx2, bitpos2)   (((uint32_t)(regidx2) << 22) | (uint32_t)((bitpos2) << 16)\
                                                            | (((uint32_t)(regidx) << 6) | (uint32_t)(bitpos)))
#define FMC_REG_VAL2(offset)            (REG32(FMC + ((uint32_t)(offset) >> 22)))
#define FMC_BIT_POS2(val)               (((uint32_t)(val) & 0x001F0000U) >> 16)

/* register offset */
#define FMC_STAT_REG_OFFSET             ((uint32_t)0x00000010U)            /*!< STAT register offset */
#define FMC_CTL_REG_OFFSET              ((uint32_t)0x0000000CU)            /*!< CTL register offset */
#define FMC_OBCTL_REG_OFFSET            ((uint32_t)0x00000018U)            /*!< OBCTL register offset */

/* FMC flags */
typedef enum {
    /* flags in STAT register */
    FMC_FLAG_BUSY = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 0U),               /*!< flash busy flag */
    FMC_FLAG_END = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 16U),               /*!< flash end of operation flag */
    FMC_FLAG_WPERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 17U),             /*!< flash erase/program protection error flag */
    FMC_FLAG_PGSERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 18U),            /*!< flash program sequence error flag */
    FMC_FLAG_RPERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 23U),             /*!< flash read protection error flag */
    FMC_FLAG_RSERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 24U),             /*!< flash read secure error flag */
    FMC_FLAG_ECCCOR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 25U),            /*!< flash one bit correct error flag */
    FMC_FLAG_ECCDET = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 26U),            /*!< flash two bits detect error flag */
    FMC_FLAG_OBMERR = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 30U),            /*!< option byte modify error flag */
    FMC_FLAG_FECC = FMC_REGIDX_BIT(FMC_STAT_REG_OFFSET, 31U)               /*!< flash ECC function flag */
} fmc_flag_enum;

